#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <iostream>

int main()
{
    setlocale(LC_ALL, "Russian");
    int d, m, y;
    printf("Введите дату рождения: \n");
    printf("День: ");
    scanf("%i", &d);
    printf("Месяц: ");
    scanf("%i", &m);
    printf("Год: ");
    scanf("%i", &y);

    // 1. Год рождения: високосный или нет
    if (y % 4 == 0)
    {
        printf("Год рождения: Високосный!\n");
    }
    else
    {
        printf("Год рождения: Не високосный!\n");
    }

    // 2.Год по восточному календарю (12 символов года, которые каждые 12 лет повторяются)
    int yearDigit = y % 12;
    switch (yearDigit)
    {
        case 0:
        {
            printf("Год по восточному календарю: Обезьяны!\n");
            break;
        }
        case 1:
        {
            printf("Год по восточному календарю: Петуха!\n");
            break;
        }
        case 2:
        {
            printf("Год по восточному календарю: Собаки!\n");
            break;
        }
        case 3:
        {
            printf("Год по восточному календарю: Свиньи!\n");
            break;
        }
        case 4:
        {
            printf("Год по восточному календарю: Крысы!\n");
            break;
        }
        case 5:
        {
            printf("Год по восточному календарю: Быка!\n");
            break;
        }
        case 6:
        {
            printf("Год по восточному календарю: Тигра!\n");
            break;
        }
        case 7:
        {
            printf("Год по восточному календарю: Кролика!\n");
            break;
        }
        case 8:
        {
            printf("Год по восточному календарю: Дракона!\n");
            break;
        }
        case 9:
        {
            printf("Год по восточному календарю: Змеи!\n");
            break;
        }
        case 10:
        {
            printf("Год по восточному календарю: Лошади!\n");
            break;
        }
        case 11:
        {
            printf("Год по восточному календарю: Овцы!\n");
            break;
        }

    }

    // 3.Знак зодиака (учитывая что знак находится после 21 числа каждого месяца и до 20 числа)
    if (((m == 12) && (d >= 21)) || ((m == 01) && (d < 21)))
    {
        printf("Знак зодиака: Козерог!\n");
    }
    else
    {
        if (((m == 01) && (d >= 21)) || ((m == 02) && (d < 21)))
        {
            printf("Знак зодиака: Водолей!\n");
        }
        else
        {
            if (((m == 02) && (d >= 21)) || ((m == 03) && (d < 21)))
            {
                printf("Знак зодиака: Рыбы!\n");
            }
            else
            {
                if (((m == 03) && (d >= 21)) || ((m == 04) && (d < 21)))
                {
                    printf("Знак зодиака: Овен!\n");
                }
                else
                {
                    if (((m == 04) && (d >= 21)) || ((m == 05) && (d < 21)))
                    {
                        printf("Знак зодиака: Телец!\n");
                    }
                    else
                    {
                        if (((m == 05) && (d >= 21)) || ((m == 06) && (d < 21)))
                        {
                            printf("Знак зодиака: Близнецы!\n");
                        }
                        else
                        {
                            if (((m == 06) && (d >= 21)) || ((m == 07) && (d < 21)))
                            {
                                printf("Знак зодиака: Рак!\n");
                            }
                            else
                            {
                                if (((m == 07) && (d >= 21)) || ((m == 8) && (d < 21)))
                                {
                                    printf("Знак зодиака: Лев!\n");
                                }
                                else
                                {
                                    if (((m == 8) && (d >= 21)) || ((m == 9) && (d < 21)))
                                    {
                                        printf("Знак зодиака: Дева!\n");
                                    }
                                    else
                                    {
                                        if (((m == 9) && (d >= 21)) || ((m == 10) && (d < 21)))
                                        {
                                            printf("Знак зодиака: Весы!\n");
                                        }
                                        else
                                        {
                                            if (((m == 10) && (d >= 21)) || ((m == 11) && (d < 21)))
                                            {
                                                printf("Знак зодиака: Скорпион!\n");
                                            }
                                            else
                                            {
                                                if (((m == 11) && (d >= 21)) || ((m == 12) && (d < 21)))
                                                {
                                                    printf("Знак зодиака: Стрелец!\n");
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }

}
